'''
Первое, что мне пришло на ум после прочтения условия задачи это подобные входные данные: [1,2,4] 256. 
Потому что нужны уникальные комбинации, а уникальными по условию же задачи можно считать: "frequency 
of at least one of the chosen numbers is different". То есть достаточно заменить какую-либо четвёрку
на две двойки и мы уже получаем уникальную комбинацию, уж не говоря о том, что 256 это 2 в степени 8, 
то есть сумма из 128-ми двоек, а так же сумма из 64-ёх 4-ок и 256 единиц. И здесь можно привести 
несколько подобных входных данных, где не только целевое число может складываться из чисел списка
кратное количество раз, но и числа из чисел самого списка.

Какой же эффективный алгоритм для подобных входных данных?
'''