'''
Составленная до этой функция my_search2() работала неправильно: например, при входных candidates=[2,3,5], 
target=8 - та функция выдавала [[2,3]], когда должна была [[2,2,2,2],[2,3,3],[3,5]]. В попытках разобраться,
почему выдаётся такой результат и куда теряются остальные списки, я пришёл к выводу, что каждый рекурсивный
вызов работает в итоге с пустой result, которая создаётся за пределами функции. Тогда в тестовой функции
my_test2() я добавил, возврат результирущего списка, а рекурсивный вызов, соответственно, поместил в 
инструкцию присваивания для этого же списка. В результате ф-я перестала работать вовсе, выдавая на проверке
условия: if comb not in result - следующее исключение:
UnboundLocalError: cannot access local variable 'result' where it is not associated with a value
Может создать другую переменную? Хотя нет, скорее всего, дело в том, что список не передаётся в качестве
аргумента! Поэтому для каждого рекрсивного вызова он пустой! 

Итак, после этого исправления, то есть указав список в качества аргумента, результат... почти не изменился.
Поникнув и немного потомившись, ходя по кругу, я решил обратить внимание на переменную comb - дело в том, 
что строка print(f'В результат: {comb}') показывала "В результат: [2, 2, 2, 2]", а строка 
print(f'Итог: {result}') при этом показывала "Итог: [[2, 2, 2]]", то есть как будто бы инструкция del comb[-1]
удаляла элемент и в двумерном списке result. И я решил просто передать в result не comb, а comb[:], то есть
копию, не смотря на то не верил в какие-либо изменения. Однако... это изменило всё и теперь, наконец-то 
возвращаются все подобранные комбинации внутри списка. Эта ситуация в очередной раз показала мне, что с 
мутируемыми типами данных надо быть осторожнее и внимательнее. Видимо, даже при помещении списка в другой
список помещается ссылка не на новую ячейку памяти с копией, а на ту же, где хранится оригинальный список, 
поэтому, чтобы зафиксировать список в определённом виде перед его новыми изменениями, надо именно сохранять 
его копию.

Тем не менее возвращаемые комбинации неправильные. По выводу в терминале обнаруживается следующий участок,
где начинают добавляться плохие данные:
В результат: [2, 3, 3]
Итог: [[2, 2, 2, 2], [2, 3, 3]]
1: [2, 5]
Итог: [[2, 2, 2, 2], [2, 3, 3]]
Итог: [[2, 2, 2, 2], [2, 3, 3]]
1: [2, 3]
1: [2, 3, 2]
1: [2, 3, 2, 2]
Итог: [[2, 2, 2, 2], [2, 3, 3]]
1: [2, 3, 2, 3]
В результат: [2, 2, 3, 3]
Итог: [[2, 2, 2, 2], [2, 3, 3], [2, 2, 3, 3]]
В строке 1: [2, 5] всё проходит как и должно, так же и в следующих двух строчках. То есть алгоритм должен был 
добавить ещё 2 после пятёрки, но rem выходила равной -1, в результате был исполнен блок else: break, и выведен
print(f'Итог: {result}'). Тогда поток управления программы вернулся в предыдущий рекурсивный вызов, где цикл и
добавил пятёрку, а поскольку 5 - последняя цифра в candidates, то и этот цикл был завершён, исполнен 
print(f'Итог: {result}') и произошёл возврат к предыдущему рекурсивному вызову, где вообще-то самая первая 2
должна была быть заменена на 3, но этого не произошло. Чтобы понять, почему, я решил выводить значение rem и 
даже её вычисление. 
'''
def my_test2(candidates, target):
    """
    :type candidates: List[int]
    :type target: int
    :rtype: List[List[int]]
    """
    if len(candidates) == 1:
        if target % candidates[0] == 0:
            return [candidates[0]]*target//candidates[0]
        else:
            return []
    if target == 1:
        return []
    if target == 2:
        if 2 in candidates:
            return [2]
        else: 
            return []
    result = []
    candidates.sort()
    comb = []
    def find_num(target):
        for n1 in candidates:
            rem = target - n1   
            print(f'rem = {target} - {n1}') 
            if n1 != candidates[0]:
                del comb[-1]
            if rem == 0:
                comb.append(n1)
                print(f'rem==0! {rem}: {comb}')
                comb.sort()
                if comb not in result:
                    print(f'В результат: {comb}')
                    result.append(comb[:])
                del comb[-1]
                break
            elif rem > 0:
                comb.append(n1)
                print(f'rem>0! {rem}: {comb}')
                find_num(rem, result)
            else:
                break
        print(f'Итог: {result}')
    find_num(target, result)
    return result
print(my_test2([2,3,5], 8))



'''
Мой предыдущий алгоритм разросся до вложенных циклов внутри вложенных циклов и кучи условий. И всё 
время, пока я его писал, меня не оставляли мысли о том, что задача решается на самом деле куда более 
коротким алгоритмом. Поэтому я пока решил отложить написание предыдущего алгоритма (сразу внизу) и 
обдумать другие возможные интересные варианты. Тем более в условии задачи указано, что количество
всех комбинаций в тестах не будет превышать 150, а потому, может оказаться, что оптимизировать 
решение под подобные входные данные: [2,4,16,32] 256 - вовсе необязательно. 

Нужно понять логику составления комбинаций и начать стоит с наиболее простых входных данных, 
поскольку достижению понимания всегда мешает переусложнённость. 
[2, 3, 5, 7] 13
[3,3,3,2,2]
[2,2,2,2,2,3]
[5,5,3]
[7,3,3]
[2,5,3,3]
Что если отнимать первое число из массива от целевого, а потом искать полученное число из сумм 
остальных чисел? И это опять цикл, вложенный в цикл. Думая так долго об этих вложенных циклах, я
начинаю задумываться о рекурсивной функции: производительность необязательно будет выше, но зато
какой красивый код... 
Чтобы получились результаты выше при тех входных данных, очевидно, что внутри рекурсивной функции 
должен быть цикл, в котором от целевого значения будет отниматься целевая переменная цикла. Это 
рекурсивный случай, вернее его зачаток (на ум пока приходит только это), но какой базовый случай?
Если целевое равно нулю, поместить целевую переменную в список? Опять же... пока только это. 

В задачи два списка, которые должны меняться по мере рекурсивных вызовов: комбинация и список этих 
комбинаций. Очевидно, создавать внутри рекрсивного вызова не годится, значит надо передавать их как 
аргументы или создать отдельную рекурсиную функцию, а может и то, и другое? И когда комбинация должна
отправляться в результат? Касательно последнего вопроса, ограничусь пока флаговой переменной, которая
будет True (то есть комбинация получилась), только когда target = 0. 

Надо решить, когда будет наращиваться комбинация. При моём алгоритме реалистичным выглядит вариант,
когда наращивание происходит до достижения базового случая, а при его достижении готовая комбинация
добавляется в результирующий список.

Для предотвращения отправки в результат индентичных комбинаций, каждая из них будет сортироваться и
выполняться проверка на наличие в результирующем списке перед добавлением. Такой подход к решению
этой проблемы неэффективен, так как будут фактически выполняться ненужные рекурсивные вызовы, уж не
говоря об операциях сортировки и сравнения списков. Но это гарантирует получение правильного 
результата.
'''
def my_search2(candidates, target):
    if len(candidates) == 1:
        if target % candidates[0] == 0:
            return [candidates[0]]*target//candidates[0]
        else:
            return []
    if target == 1:
        return []
    if target == 2:
        if 2 in candidates:
            return [2]
        else: 
            return []
    result = []
    candidates.sort()
    comb = []
    def find_num(target):
        for n1 in candidates:
            rem = target - n1    
            if n1 != candidates[0]:
                del comb[-1]
            comb.append(n1)
            if rem == 0:
                comb.sort()
                if comb not in result:
                    result.append(comb)
                del comb[-1]
                break
            elif rem > 0:
                find_num(rem)
            else:
                del comb[-1]
                break
    find_num(target)
    return result
    pass




'''
Первое, что мне пришло на ум после прочтения условия задачи это подобные входные данные: [1,2,4] 256. 
Потому что нужны уникальные комбинации, а уникальными по условию же задачи можно считать: "frequency 
of at least one of the chosen numbers is different". То есть достаточно заменить какую-либо четвёрку
на две двойки и мы уже получаем уникальную комбинацию, уж не говоря о том, что 256 это 2 в степени 8, 
то есть сумма из 128-ми двоек, а так же сумма из 64-ёх 4-ок и 256 единиц. И здесь можно привести 
несколько подобных входных данных, где не только целевое число может складываться из чисел списка
кратное количество раз, но и числа из чисел самого списка.

К счастью, ограничения задачи исключают единицу и все числа больше 40-ка. Тем не менее
список можно дополнить: [2,4,16,32] 256. Выходит комбинации следующие: 128 двоек, 64 
четвёрок, 16 чисел по 16 и 8 чисел по 32, а так же множество комбинаций, где каждые из 
этих чисел заменяют друг друга разное количество раз. Какой же эффективный алгоритм для 
подобных входных данных? Чтобы понять это, нужно начать писать хотя бы плохие алгоритмы.
'''
def my_search1(candidates, target):
    """
    :type candidates: List[int]
    :type target: int
    :rtype: List[List[int]]
    """
    candidates.sort()
    result = []
    comb = []
    for n1 in candidates:
        if target % n1 == 0:
            result.append([n1]*(target//n1))
            if n1 != candidates[-1]:
                lastn = candidates[candidates.index(n1)+1:]
                for n2 in lastn:
                    if n2 % n1 == 0:
                        repl = n2 // n1
                        nums = [n2] + result[-1][repl:]
                        while n1 in nums:
                            result.append(nums)
                            if len(nums)-repl <= 0:
                                break
                            nums = [n2] + nums[:len(nums)-repl]
                    
