'''
Первое, что мне пришло на ум после прочтения условия задачи это подобные входные данные: [1,2,4] 256. 
Потому что нужны уникальные комбинации, а уникальными по условию же задачи можно считать: "frequency 
of at least one of the chosen numbers is different". То есть достаточно заменить какую-либо четвёрку
на две двойки и мы уже получаем уникальную комбинацию, уж не говоря о том, что 256 это 2 в степени 8, 
то есть сумма из 128-ми двоек, а так же сумма из 64-ёх 4-ок и 256 единиц. И здесь можно привести 
несколько подобных входных данных, где не только целевое число может складываться из чисел списка
кратное количество раз, но и числа из чисел самого списка.

К счастью, ограничения задачи исключают единицу и все числа больше 40-ка. Тем не менее
список можно дополнить: [2,4,16,32] 256. Выходит комбинации следующие: 128 двоек, 64 
четвёрок, 16 чисел по 16 и 8 чисел по 32, а так же множество комбинаций, где каждые из 
этих чисел заменяют друг друга разное количество раз. Какой же эффективный алгоритм для 
подобных входных данных? Чтобы понять это, нужно начать писать хотя бы плохие алгоритмы.
'''
def my_search1(candidates, target):
    """
    :type candidates: List[int]
    :type target: int
    :rtype: List[List[int]]
    """
    candidates.sort()
    result = []
    comb = []
    for n1 in candidates:
        if target % n1 == 0:
            result.append([n1]*(target//n1))
        if n1 != candidates[-1]:
            for n2 in candidates[candidates.index(n1)+1:]:
                if n1 == n2:
                    continue
                if n2 % n1 == 0:
