'''
Эту задачу можно решить двумя способами: вложенными циклами или рекурсивной функцией. 
Первое решение: внешний цикл считает номер в последовательности, а вложенный уже формирует
результат последовательности. Получить сам результат несложно: это длина дубликатов цифры
в строке + сама цифра и так для каждой цифры в строке. Однако вложенные циклы это всегда
огромное количество итераций, равное произведению количества итераций каждого цикла, поэтому,
задача, решение которой использует вложенные циклы, может иметь более эффективное решение
через рекурсивную функцию. И хотя первое решение ещё можно оптимизировать, второе всё равное 
будет иметь преимущество или, как минимум, будет не хуже.
'''
def my_solution1(n):
    """
    :type n: int
    :rtype: str
    """
    if n == 1:
        return '1'
    if n == 2:
        return '11'
    result = '11'
    n -= 2
    for n1 in range(n):
        string = result
        nums = result[0]
        result = ''
        for n2 in range(1, len(string)):
            if string[n2] != nums[0]:
                result = result + str(len(nums)) + nums[0]
                nums = ''
            nums += string[n2]
        result = result + str(len(nums)) + nums[0]
    return result


'''
В вызов рекурсивной функции необходимо передавать уменьшающееся значение передаваемого параметра,
чтобы однажды функция достигла базового случая: когда n = 1, возвращается '1', а не вызов, в то
время как рекурсивный случай будет возвращать результат последовательности, полученный в цикле 
(result). Для получения результата вместо конкатенации строки, содержащей дубликаты, будут 
использоваться две переменные: одна накопительная будет считать длину дубликатов (count), а другая
будет ссылаться на цифру, дубликаты которой считаются - это быстрее, так как использование 
дополнительной конкатенации, как в первом решении, требует прописания дополнительного условия 
(которое в случае с рекурсивной функцией будет провераться много раз, а не единожды), обхода строки 
по индексу или её копирование, а также получения элемента по индексу в нескольких местах, что в 
совокупности будет исполняться явно дольше, чем дополнительная инструкция присваивания с простейшей
операцией. И результат исполнения цикла возвращается в рекурсивном случае.
'''
def my_solution2(n):
    """
    :type n: int
    :rtype: str
    """
    if n == 1:
        return '1'
    string = my_solution2(n-1)
    num = string[0]
    count = 0
    result = ''
    for n1 in string:
        if num != n1:
            result = result + str(count) + num
            count = 0
        count += 1
        num = n1
    result = result + str(count) + num
    return result
